open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dvp.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_dvp.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 AP DVP image-data lower-half.  The immutable v3.1.1.9 public DVP
 * header describes a vendor-owned camera stream.  This file adapts its
 * frame callback to NuttX imgdata_s without adding a character-device ABI.
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include <sys/time.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/sched.h>
#include <nuttx/spinlock.h>
#include <nuttx/video/imgdata.h>
#include <nuttx/video/video.h>
#include <nuttx/wqueue.h>

#include <components/dvp_camera.h>
#include <driver/dma.h>
#include <driver/h264.h>
#include <driver/i2c.h>
#include <driver/jpeg_enc.h>
#include <driver/yuv_buf.h>
#include <sdkconfig.h>

#include <arch/chip/bk7258_dvp.h>
#include <arch/chip/bk7258_i2c.h>
#include <arch/chip/bk7258_pm.h>
#ifdef CONFIG_BK7258_PSRAM
#  include <arch/chip/bk7258_psram.h>
#endif

#include "bk7258_media_root.h"

#define BK7258_DVP_MAX_FRAMES 8
#define BK7258_DVP_EVENT_DEPTH 8
#define BK7258_DVP_RESULT_ERROR 1
#define BK7258_DVP_ALLOC_MAGIC 0x44565041u

/* SDK v3.1.1.9 routes this DVP-owned PSRAM vote through its FreeRTOS
 * MB_CHNL_PWC service.  NuttX owns that mailbox and keeps physical PSRAM
 * alive with the CP-side AS_MEM lifetime instead.  Keep the raw ABI values
 * local so this compatibility boundary does not expose vendor PM enums.
 */

#define BK7258_DVP_SDK_PSRAM_VIDP_JPEG_EN 4u
#define BK7258_DVP_SDK_POWER_ON            0u
#define BK7258_DVP_SDK_POWER_OFF           1u

#ifdef CONFIG_BK7258_PSRAM
struct bk7258_dvp_allocation_s
{
  FAR void *base;
  uint32_t magic;
};
#endif

struct bk7258_dvp_event_s
{
  FAR struct frame_buffer_t *frame;
  uint8_t result;
};

struct bk7258_dvp_s
{
  struct imgdata_s data;
  struct bk7258_dvp_config_s config;
  bk_dvp_config_t sdk_config;
  struct bk7258_dvp_i2c_write_s deferred_i2c[
    BK7258_DVP_DEFERRED_I2C_WRITES];
  uint8_t deferred_i2c_count;
  camera_handle_t handle;

  spinlock_t lock;
  mutex_t api_lock;
  struct work_s complete_work;
  struct bk7258_dvp_event_s events[BK7258_DVP_EVENT_DEPTH];
  struct frame_buffer_t frames[BK7258_DVP_MAX_FRAMES];
  bool frame_busy[BK7258_DVP_MAX_FRAMES];
  uint8_t event_head;
  uint8_t event_count;
  bool work_queued;
  bool worker_running;
  pid_t worker_tid;
  bool stopping;
  bool configured;
  bool pm_clock_held;
  bool pm_mclk_held;
  bool pm_frequency_held;
  bool i2c_driver_held;
  bool suspended;
  bool capture_active;
  FAR uint8_t *next_buffer;
  uint32_t next_size;
  imgdata_capture_t capture_cb;
  FAR void *capture_arg;
};

static struct bk7258_dvp_s g_bk7258_dvp =
{
  .api_lock = NXMUTEX_INITIALIZER,
};

static FAR struct frame_buffer_t *bk7258_dvp_frame_malloc(
  image_format_t format, uint32_t size);
static void bk7258_dvp_frame_complete(image_format_t format,
                                      FAR struct frame_buffer_t *frame,
                                      int result);
static int bk7258_dvp_data_uninit(FAR struct imgdata_s *data);

static int bk7258_dvp_i2c_driver_acquire(FAR struct bk7258_dvp_s *priv)
{
  int ret;

  if (priv->i2c_driver_held)
    {
      return 0;
    }

  ret = bk7258_i2c_driver_acquire();
  if (ret == 0)
    {
      priv->i2c_driver_held = true;
    }

  return ret;
}

static int bk7258_dvp_i2c_driver_release(FAR struct bk7258_dvp_s *priv)
{
  int ret;

  if (!priv->i2c_driver_held)
    {
      return 0;
    }

  ret = bk7258_i2c_driver_release();
  if (ret == 0)
    {
      priv->i2c_driver_held = false;
    }

  return ret;
}

static const bk_dvp_callback_t g_bk7258_dvp_callback =
{
  .malloc = bk7258_dvp_frame_malloc,
  .complete = bk7258_dvp_frame_complete,
};

static int bk7258_dvp_error(bk_err_t error)
{
  switch (error)
    {
      case BK_OK:
        return 0;

      case BK_ERR_PARAM:
      case BK_ERR_NULL_PARAM:
        return -EINVAL;

      case BK_ERR_NO_MEM:
        return -ENOMEM;

      case BK_ERR_TIMEOUT:
        return -ETIMEDOUT;

      case BK_ERR_BUSY:
      case BK_ERR_IN_PROGRESS:
        return -EBUSY;

      case BK_ERR_NOT_SUPPORT:
        return -ENOTSUP;

      case BK_ERR_NO_DEV:
      case BK_ERR_NOT_FOUND:
        return -ENODEV;

      case BK_ERR_SHUT_DOWN:
        return -ESHUTDOWN;

      default:
        /* BK_FAIL and module-specific vendor errors are not errno values. */
        return -EIO;
    }
}

#ifdef CONFIG_BK7258_DVP_BOARD_GLUE
extern bk_err_t __real_bk_i2c_init_v2(i2c_id_t id,
                                      FAR const i2c_config_t *config);
extern bk_err_t __real_bk_i2c_deinit_v2(i2c_id_t id);
extern bk_err_t __real_bk_i2c_memory_read_v2(
  i2c_id_t id, FAR const i2c_mem_param_t *param);
extern bk_err_t __real_bk_i2c_memory_write_v2(
  i2c_id_t id, FAR const i2c_mem_param_t *param);
extern bk_err_t __real_bk_pm_module_vote_psram_ctrl(
  uint32_t module, uint32_t power_state);
extern void __real_dvp_camera_mclk_enable(mclk_freq_t mclk);

bk_err_t __wrap_bk_pm_module_vote_psram_ctrl(
  uint32_t module, uint32_t power_state)
{
  bk_err_t ret;

  if (module == BK7258_DVP_SDK_PSRAM_VIDP_JPEG_EN &&
      (power_state == BK7258_DVP_SDK_POWER_ON ||
       power_state == BK7258_DVP_SDK_POWER_OFF))
    {
#ifdef CONFIG_BK7258_PSRAM
      /* The board allocated every DVP frame from the project media slab
       * before bk_dvp_open(), so an ON vote is valid only while that CP-owned
       * PSRAM lifetime is already confirmed.  OFF deliberately leaves AS_MEM
       * ownership unchanged; another AP service may still use PSRAM.
       */

      ret = power_state == BK7258_DVP_SDK_POWER_ON &&
            !bk7258_psram_ready() ? BK_FAIL : BK_OK;
#else
      ret = power_state == BK7258_DVP_SDK_POWER_ON ? BK_FAIL : BK_OK;
#endif

      return ret;
    }

