open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dvp.c
  ret = __real_bk_pm_module_vote_psram_ctrl(module, power_state);

  return ret;
}

static FAR const struct bk7258_dvp_i2c_ops_s *
bk7258_dvp_board_i2c(i2c_id_t id)
{
  FAR const struct bk7258_dvp_binding_s *binding =
    g_bk7258_dvp.config.binding;

  if (binding == NULL || binding->i2c == NULL ||
      (unsigned int)id != binding->i2c_bus)
    {
      return NULL;
    }

  return binding->i2c;
}

static bk_err_t bk7258_dvp_board_i2c_result(int ret)
{
  if (ret == 0)
    {
      return BK_OK;
    }

  if (ret == -EBUSY)
    {
      return BK_ERR_I2C_SM_BUS_BUSY;
    }

  if (ret == -ETIMEDOUT)
    {
      return BK_ERR_I2C_ACK_TIMEOUT;
    }

  return BK_FAIL;
}

static bk_err_t bk7258_dvp_board_i2c_transfer(
  i2c_id_t id, FAR const i2c_mem_param_t *param, bool read)
{
  FAR const struct bk7258_dvp_binding_s *binding =
    g_bk7258_dvp.config.binding;
  FAR const struct bk7258_dvp_i2c_ops_s *ops =
    bk7258_dvp_board_i2c(id);
  struct bk7258_dvp_i2c_transfer_s transfer;
  int ret;

  if (ops == NULL)
    {
      return read ? __real_bk_i2c_memory_read_v2(id, param) :
                    __real_bk_i2c_memory_write_v2(id, param);
    }

  if (param == NULL || param->data == NULL || param->data_size == 0)
    {
      return BK_ERR_PARAM;
    }

  if (param->mem_addr_size == I2C_MEM_ADDR_SIZE_8BIT)
    {
      transfer.memory_address_bytes = 1u;
    }
  else if (param->mem_addr_size == I2C_MEM_ADDR_SIZE_16BIT)
    {
      transfer.memory_address_bytes = 2u;
    }
  else
    {
      return BK_ERR_PARAM;
    }

  transfer.address = param->dev_addr;
  transfer.memory_address = param->mem_addr;
  transfer.buffer = param->data;
  transfer.length = param->data_size;
  if (read)
    {
      ret = ops->read == NULL ? -ENOSYS :
            ops->read(binding->arg, &transfer);
    }
  else
    {
      ret = ops->write == NULL ? -ENOSYS :
            ops->write(binding->arg, &transfer);
    }

  return bk7258_dvp_board_i2c_result(ret);
}

bk_err_t __wrap_bk_i2c_init_v2(i2c_id_t id,
                                FAR const i2c_config_t *config)
{
  FAR const struct bk7258_dvp_binding_s *binding =
    g_bk7258_dvp.config.binding;
  FAR const struct bk7258_dvp_i2c_ops_s *ops =
    bk7258_dvp_board_i2c(id);

  if (ops == NULL)
    {
      return __real_bk_i2c_init_v2(id, config);
    }

  return bk7258_dvp_board_i2c_result(
    ops->initialize == NULL ? 0 : ops->initialize(binding->arg));
}

bk_err_t __wrap_bk_i2c_deinit_v2(i2c_id_t id)
{
  FAR const struct bk7258_dvp_binding_s *binding =
    g_bk7258_dvp.config.binding;
  FAR const struct bk7258_dvp_i2c_ops_s *ops =
    bk7258_dvp_board_i2c(id);

  if (ops == NULL)
    {
      return __real_bk_i2c_deinit_v2(id);
    }

  return bk7258_dvp_board_i2c_result(
    ops->uninitialize == NULL ? 0 : ops->uninitialize(binding->arg));
}

bk_err_t __wrap_bk_i2c_memory_read_v2(
  i2c_id_t id, FAR const i2c_mem_param_t *param)
{
  return bk7258_dvp_board_i2c_transfer(id, param, true);
}

bk_err_t __wrap_bk_i2c_memory_write_v2(
  i2c_id_t id, FAR const i2c_mem_param_t *param)
{
  return bk7258_dvp_board_i2c_transfer(id, param, false);
}

void __wrap_dvp_camera_mclk_enable(mclk_freq_t mclk)
{
  FAR const struct bk7258_dvp_binding_s *binding =
    g_bk7258_dvp.config.binding;

  __real_dvp_camera_mclk_enable(mclk);
  if (binding != NULL && binding->mclk_started != NULL)
    {
      binding->mclk_started(binding->arg);
    }

}
#endif /* CONFIG_BK7258_DVP_BOARD_GLUE */

#ifdef CONFIG_BK7258_DVP_H264_COMPAT
extern bk_err_t __real_bk_h264_encode_enable(void);
extern bk_err_t __real_bk_yuv_buf_start(yuv_mode_t work_mode);
extern int __real_video_register(FAR const char *devpath,
                                 FAR struct v4l2_s *ctx);
extern int32_t __real_sys_drv_core_intr_group2_enable(uint32_t core_id,
                                                      uint32_t mask);
extern int __real_dvp_camera_i2c_write_uint8(uint8_t addr, uint8_t reg,
                                             uint8_t value);

static bool g_bk7258_dvp_h264_opening;
static bool g_bk7258_dvp_h264_yuv_deferred;
static bool g_bk7258_dvp_h264_encode_deferred;
static bool g_bk7258_dvp_yuv_irq_deferred;
static bool g_bk7258_dvp_h264_irq_deferred;
static uint32_t g_bk7258_dvp_h264_irq_core;
static FAR const struct v4l2_ops_s *g_bk7258_dvp_capture_vops;
static struct v4l2_ops_s g_bk7258_dvp_h264_vops;

#define BK7258_H264_GROUP2_MASK (1u << (46u - 32u))
#define BK7258_YUVB_GROUP2_MASK (1u << (58u - 32u))

/* The pinned NuttX capture upper-half publishes V4L2_PIX_FMT_H264 in its
 * public headers, but capture_try_fmt() does not yet accept it.  Keep the
 * user-visible ABI standard and translate only at the v4l2 capture boundary
 * to the existing compressed imgdata token consumed by this lower-half.
 */

static bool bk7258_dvp_h264_format_alias(FAR struct v4l2_format *format)
{
  if (format != NULL && format->fmt.pix.pixelformat == V4L2_PIX_FMT_H264)
    {
      format->fmt.pix.pixelformat = V4L2_PIX_FMT_JPEG_WITH_SUBIMG;
      return true;
    }

  return false;
}

static int bk7258_dvp_h264_g_fmt(FAR struct file *filep,
                                 FAR struct v4l2_format *format)
{
  int ret = g_bk7258_dvp_capture_vops->g_fmt(filep, format);

  if (ret == OK && format->fmt.pix.pixelformat ==
                   V4L2_PIX_FMT_JPEG_WITH_SUBIMG)
    {
      format->fmt.pix.pixelformat = V4L2_PIX_FMT_H264;
    }

  return ret;
}

static int bk7258_dvp_h264_s_fmt(FAR struct file *filep,
                                 FAR struct v4l2_format *format)
{
  bool aliased = bk7258_dvp_h264_format_alias(format);
  int ret = g_bk7258_dvp_capture_vops->s_fmt(filep, format);

  if (aliased)
    {
      format->fmt.pix.pixelformat = V4L2_PIX_FMT_H264;
    }

  return ret;
}

static int bk7258_dvp_h264_try_fmt(FAR struct file *filep,
                                   FAR struct v4l2_format *format)
{
  bool aliased = bk7258_dvp_h264_format_alias(format);
  int ret = g_bk7258_dvp_capture_vops->try_fmt(filep, format);

  if (aliased)
    {
      format->fmt.pix.pixelformat = V4L2_PIX_FMT_H264;
    }

  return ret;
}

