open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dvp.c
static int bk7258_dvp_h264_enum_fmt(FAR struct file *filep,
                                    FAR struct v4l2_fmtdesc *format)
{
  int ret = g_bk7258_dvp_capture_vops->enum_fmt(filep, format);

  if (ret == OK && format->pixelformat == V4L2_PIX_FMT_JPEG_WITH_SUBIMG)
    {
      format->pixelformat = V4L2_PIX_FMT_H264;
      strncpy((FAR char *)format->description, "H264",
              sizeof(format->description));
      format->description[sizeof(format->description) - 1u] = '\0';
    }

  return ret;
}

static int bk7258_dvp_h264_enum_frminterval(
  FAR struct file *filep, FAR struct v4l2_frmivalenum *interval)
{
  bool aliased = interval != NULL &&
                 interval->pixel_format == V4L2_PIX_FMT_H264;
  int ret;

  if (aliased)
    {
      interval->pixel_format = V4L2_PIX_FMT_JPEG_WITH_SUBIMG;
    }

  ret = g_bk7258_dvp_capture_vops->enum_frminterval(filep, interval);
  if (aliased)
    {
      interval->pixel_format = V4L2_PIX_FMT_H264;
    }

  return ret;
}

static int bk7258_dvp_h264_enum_frmsize(
  FAR struct file *filep, FAR struct v4l2_frmsizeenum *size)
{
  bool aliased = size != NULL && size->pixel_format == V4L2_PIX_FMT_H264;
  int ret;

  if (aliased)
    {
      size->pixel_format = V4L2_PIX_FMT_JPEG_WITH_SUBIMG;
    }

  ret = g_bk7258_dvp_capture_vops->enum_frmsize(filep, size);
  if (aliased)
    {
      size->pixel_format = V4L2_PIX_FMT_H264;
    }

  return ret;
}

int __wrap_video_register(FAR const char *devpath, FAR struct v4l2_s *ctx)
{
  FAR const struct v4l2_ops_s *original;
  int ret;

  if (devpath == NULL || ctx == NULL || ctx->vops == NULL ||
      strcmp(devpath, "/dev/video0") != 0)
    {
      return __real_video_register(devpath, ctx);
    }

  original = ctx->vops;
  g_bk7258_dvp_capture_vops = original;
  memcpy(&g_bk7258_dvp_h264_vops, original,
         sizeof(g_bk7258_dvp_h264_vops));
  g_bk7258_dvp_h264_vops.g_fmt = bk7258_dvp_h264_g_fmt;
  g_bk7258_dvp_h264_vops.s_fmt = bk7258_dvp_h264_s_fmt;
  g_bk7258_dvp_h264_vops.try_fmt = bk7258_dvp_h264_try_fmt;
  g_bk7258_dvp_h264_vops.enum_fmt = bk7258_dvp_h264_enum_fmt;
  g_bk7258_dvp_h264_vops.enum_frminterval =
    bk7258_dvp_h264_enum_frminterval;
  g_bk7258_dvp_h264_vops.enum_frmsize = bk7258_dvp_h264_enum_frmsize;
  ctx->vops = &g_bk7258_dvp_h264_vops;

  ret = __real_video_register(devpath, ctx);
  if (ret < 0)
    {
      ctx->vops = original;
      g_bk7258_dvp_capture_vops = NULL;
    }

  return ret;
}

int32_t __wrap_sys_drv_core_intr_group2_enable(uint32_t core_id,
                                               uint32_t mask)
{
  if (g_bk7258_dvp_h264_opening && mask == BK7258_H264_GROUP2_MASK)
    {
      g_bk7258_dvp_h264_irq_deferred = true;
      g_bk7258_dvp_h264_irq_core = core_id;
      return 0;
    }

  return __real_sys_drv_core_intr_group2_enable(core_id, mask);
}

bk_err_t __wrap_bk_yuv_buf_start(yuv_mode_t work_mode)
{
  if (g_bk7258_dvp_h264_opening && work_mode == H264_MODE)
    {
      g_bk7258_dvp_h264_yuv_deferred = true;
      return BK_OK;
    }

  return __real_bk_yuv_buf_start(work_mode);
}

bk_err_t __wrap_bk_h264_encode_enable(void)
{
  if (g_bk7258_dvp_h264_opening)
    {
      g_bk7258_dvp_h264_encode_deferred = true;
      return BK_OK;
    }

  return __real_bk_h264_encode_enable();
}

int __wrap_dvp_camera_i2c_write_uint8(uint8_t addr, uint8_t reg,
                                      uint8_t value)
{
  FAR const struct bk7258_dvp_binding_s *binding =
    g_bk7258_dvp.config.binding;
  struct bk7258_dvp_i2c_write_s write;
  int action = BK7258_DVP_I2C_WRITE_PASS;

  write.addr = addr;
  write.reg = reg;
  write.value = value;
  write.immediate_value = value;

  if (g_bk7258_dvp_h264_opening && binding != NULL &&
      binding->i2c_write != NULL)
    {
      action = binding->i2c_write(binding->arg, &write);
      if (action < 0)
        {
          return action;
        }

      if (action == BK7258_DVP_I2C_WRITE_DEFER)
        {
          if (g_bk7258_dvp.deferred_i2c_count >=
              BK7258_DVP_DEFERRED_I2C_WRITES)
            {
              return -ENOMEM;
            }

          g_bk7258_dvp.deferred_i2c[g_bk7258_dvp.deferred_i2c_count++] =
            write;

          /* Keep the sensor output disabled until the SDK has completed its
           * first H.264 bring-up sequence.  The original write is replayed
           * through the real SDK symbol once open returns. */

          return __real_dvp_camera_i2c_write_uint8(
            addr, reg, write.immediate_value);
        }

      if (action != BK7258_DVP_I2C_WRITE_PASS)
        {
          return -EINVAL;
        }
    }

  return __real_dvp_camera_i2c_write_uint8(addr, reg, value);
}
#endif

#ifdef CONFIG_BK7258_DVP_H264_COMPAT
extern int32_t __real_sys_drv_int_group2_enable(uint32_t mask);

int32_t __wrap_sys_drv_int_group2_enable(uint32_t mask)
{
  if (g_bk7258_dvp_h264_opening && mask == BK7258_YUVB_GROUP2_MASK)
    {
      g_bk7258_dvp_yuv_irq_deferred = true;
      return 0;
    }

  return __real_sys_drv_int_group2_enable(mask);
}
#endif

static int bk7258_dvp_pm_release(FAR struct bk7258_dvp_s *priv);

static int bk7258_dvp_pm_acquire(FAR struct bk7258_dvp_s *priv)
{
  enum bk7258_pm_clock_e video_clock;
  int ret;

  if (priv->sdk_config.clk_source != MCLK_24M)
    {
      return -ENOTSUP;
    }

  /* v3.1.1.9 YUV requests 480M, then JPEG overwrites the same SDK client
   * with 320M.  Keep the complete MJPEG pipeline's requirement separately:
   * the camera owns it before SDK open until SDK close has stopped DMA and
   * joined its thread.  Codec init/deinit votes must not lower this floor.
   */

  if (priv->sdk_config.img_format == IMAGE_MJPEG &&
      !priv->pm_frequency_held)
    {
      ret = bk7258_pm_frequency_vote(BK7258_PM_FREQ_CLIENT_CAMERA,
                                     BK7258_PM_OPP_480M);
      if (ret < 0)
        {
          return ret;
        }

      priv->pm_frequency_held = true;
    }

  video_clock = priv->sdk_config.img_format == IMAGE_H264 ?
                BK7258_PM_CLOCK_H264 : BK7258_PM_CLOCK_JPEG;
  if (!priv->pm_clock_held)
    {
      ret = bk7258_pm_clock_get(video_clock);
      if (ret < 0)
        {
          goto errout;
        }

      priv->pm_clock_held = true;
    }

  if (!priv->pm_mclk_held)
    {
      ret = bk7258_pm_clock_get(BK7258_PM_CLOCK_CAMERA_MCLK_24M);
      if (ret < 0)
        {
          goto errout;
        }

      priv->pm_mclk_held = true;
    }

