open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dvp.c
  return 0;

errout:
  (void)bk7258_dvp_pm_release(priv);
  return ret;
}

static int bk7258_dvp_pm_release(FAR struct bk7258_dvp_s *priv)
{
  enum bk7258_pm_clock_e video_clock;
  int result = 0;
  int ret;

  video_clock = priv->sdk_config.img_format == IMAGE_H264 ?
                BK7258_PM_CLOCK_H264 : BK7258_PM_CLOCK_JPEG;

  if (priv->pm_mclk_held)
    {
      ret = bk7258_pm_clock_put(BK7258_PM_CLOCK_CAMERA_MCLK_24M);
      if (ret >= 0)
        {
          priv->pm_mclk_held = false;
        }
      else
        {
          result = ret;
        }
    }

  if (priv->pm_clock_held)
    {
      ret = bk7258_pm_clock_put(video_clock);
      if (ret >= 0)
        {
          priv->pm_clock_held = false;
        }
      else if (result >= 0)
        {
          result = ret;
        }
    }

  if (priv->pm_frequency_held)
    {
      ret = bk7258_pm_frequency_vote(BK7258_PM_FREQ_CLIENT_CAMERA,
                                     BK7258_PM_OPP_DEFAULT);
      if (ret >= 0)
        {
          priv->pm_frequency_held = false;
        }
      else if (result >= 0)
        {
          result = ret;
        }
    }

  return result;
}

static inline FAR struct bk7258_dvp_s *bk7258_dvp_from_data(
  FAR struct imgdata_s *data)
{
  return (FAR struct bk7258_dvp_s *)((uintptr_t)data -
                                     offsetof(struct bk7258_dvp_s, data));
}

static int bk7258_dvp_frame_index(FAR struct bk7258_dvp_s *priv,
                                  FAR struct frame_buffer_t *frame)
{
  uint8_t i;

  for (i = 0; i < priv->config.frame_count; i++)
    {
      if (&priv->frames[i] == frame)
        {
          return i;
        }
    }

  return -1;
}

static void bk7258_dvp_release_frame_locked(FAR struct bk7258_dvp_s *priv,
                                            FAR struct frame_buffer_t *frame)
{
  int index = bk7258_dvp_frame_index(priv, frame);

  if (index >= 0)
    {
      priv->frame_busy[index] = false;
    }
}

static void bk7258_dvp_drop_events_locked(FAR struct bk7258_dvp_s *priv)
{
  while (priv->event_count != 0)
    {
      FAR struct bk7258_dvp_event_s *event =
        &priv->events[priv->event_head];

      bk7258_dvp_release_frame_locked(priv, event->frame);
      priv->event_head = (uint8_t)((priv->event_head + 1) %
                                   BK7258_DVP_EVENT_DEPTH);
      priv->event_count--;
    }
}

static void bk7258_dvp_schedule_failed(FAR struct bk7258_dvp_s *priv)
{
  irqstate_t flags = spin_lock_irqsave(&priv->lock);

  priv->work_queued = false;
  priv->worker_running = false;
  priv->worker_tid = (pid_t)-1;
  bk7258_dvp_drop_events_locked(priv);
  spin_unlock_irqrestore(&priv->lock, flags);
}

static bool bk7258_dvp_is_current_worker(FAR struct bk7258_dvp_s *priv)
{
  irqstate_t flags;
  bool current;
  pid_t tid = nxsched_gettid();

  flags = spin_lock_irqsave(&priv->lock);
  current = priv->worker_running && priv->worker_tid == tid;
  spin_unlock_irqrestore(&priv->lock, flags);
  return current;
}

static void bk7258_dvp_timestamp(FAR struct timeval *tv)
{
  struct timespec ts;

  /* The SDK timestamp is a 32-bit, build-dependent counter which can wrap
   * in roughly 71 minutes.  It is intentionally not exposed as a V4L2
   * timestamp; use the NuttX system clock for the upper-half ABI. */

  clock_systime_timespec(&ts);
  tv->tv_sec = ts.tv_sec;
  tv->tv_usec = ts.tv_nsec / 1000;
}

static void bk7258_dvp_complete_worker(FAR void *arg)
{
  FAR struct bk7258_dvp_s *priv = arg;
  irqstate_t state_flags;

  state_flags = spin_lock_irqsave(&priv->lock);
  priv->worker_running = true;
  priv->worker_tid = nxsched_gettid();
  spin_unlock_irqrestore(&priv->lock, state_flags);

  for (;;)
    {
      struct bk7258_dvp_event_s event;
      FAR uint8_t *target;
      FAR void *capture_arg;
      imgdata_capture_t capture_cb;
      uint32_t target_size;
      uint32_t length;
      struct timeval tv;
      uint8_t result;
      irqstate_t flags;

      flags = spin_lock_irqsave(&priv->lock);
      if (priv->event_count == 0)
        {
          priv->work_queued = false;
          priv->worker_running = false;
          priv->worker_tid = (pid_t)-1;
          spin_unlock_irqrestore(&priv->lock, flags);
          return;
        }

      event = priv->events[priv->event_head];
      priv->event_head = (uint8_t)((priv->event_head + 1) %
                                   BK7258_DVP_EVENT_DEPTH);
      priv->event_count--;
      target = priv->next_buffer;
      target_size = priv->next_size;
      priv->next_buffer = NULL;
      priv->next_size = 0;
      capture_cb = priv->capture_active ? priv->capture_cb : NULL;
      capture_arg = priv->capture_arg;
      spin_unlock_irqrestore(&priv->lock, flags);

      result = event.result;
      length = event.frame->length;
      if (capture_cb == NULL || target == NULL || result != 0)
        {
          length = 0;
        }
      else if (length > event.frame->size || length > target_size ||
               event.frame->frame == NULL)
        {
          result = BK7258_DVP_RESULT_ERROR;
          length = 0;
        }
      else
        {
          memcpy(target, event.frame->frame, length);
        }

      bk7258_dvp_timestamp(&tv);
      if (capture_cb != NULL)
        {
          /* This is the only path that calls the NuttX upper-half callback;
           * the SDK callback itself only enqueues a bounded event. */
          (void)capture_cb(result, length, &tv, capture_arg);
        }

      flags = spin_lock_irqsave(&priv->lock);
      bk7258_dvp_release_frame_locked(priv, event.frame);
      spin_unlock_irqrestore(&priv->lock, flags);
    }
}

static int bk7258_dvp_stop_stream(FAR struct bk7258_dvp_s *priv)
{
  irqstate_t flags;
  bool need_suspend;
  bool current_worker;
  int ret;
  int cancel_ret = 0;

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (priv->handle == NULL)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      nxmutex_unlock(&priv->api_lock);
      return 0;
    }

  if (priv->stopping)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      nxmutex_unlock(&priv->api_lock);

