open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dvp.c
      /* A callback may synchronously call stop_capture while an external
       * stop is already quiescing the stream.  The callback must not wait
       * for itself, while an external caller must still wait for the worker
       * before returning. */
      if (bk7258_dvp_is_current_worker(priv))
        {
          return 0;
        }

      ret = work_cancel_sync(LPWORK, &priv->complete_work);
      if (ret == -ENOENT)
        {
          ret = 0;
        }
      /* The first stop owner performs the final queue drain and clears
       * stopping.  A concurrent external stop must not release that state
       * early and allow a new start/resume to cross the owner cleanup. */
      return ret;
    }

  priv->stopping = true;
  priv->capture_active = false;
  priv->capture_cb = NULL;
  priv->capture_arg = NULL;
  /* JPEG close is synchronized by the SDK's live VSYNC handler.  Suspending
   * here asserts JPEG/YUV reset before that handshake and leaves the SDK DMA
   * and frame owner alive.  Stop delivery and drain our worker below, then
   * let bk_dvp_close() stop the JPEG pipeline in its documented order.  An
   * open JPEG handle may keep its private stream until close or a new QBUF.
   */

  need_suspend = !priv->suspended &&
                 priv->sdk_config.img_format != IMAGE_MJPEG;
  spin_unlock_irqrestore(&priv->lock, flags);

  if (need_suspend)
    {
      ret = bk7258_dvp_error(bk_dvp_suspend(priv->handle));
      if (ret == 0)
        {
          priv->suspended = true;
        }
    }

  /* Do not hold api_lock while waiting for the work queue.  A capture
   * callback is allowed to call stop_capture synchronously. */
  nxmutex_unlock(&priv->api_lock);

  current_worker = bk7258_dvp_is_current_worker(priv);
  if (!current_worker)
    {
      cancel_ret = work_cancel_sync(LPWORK, &priv->complete_work);
      if (cancel_ret == -ENOENT)
        {
          cancel_ret = 0;
        }
    }

  if (ret == 0 && cancel_ret < 0)
    {
      ret = cancel_ret;
    }

  /* Reacquire only for the final bounded-queue cleanup and state release.
   * If this is the work thread itself, leave work_queued for the worker's
   * empty-queue exit path; synchronous self-cancel is never attempted. */
  if (nxmutex_lock(&priv->api_lock) < 0)
    {
      return ret < 0 ? ret : -EINTR;
    }
  flags = spin_lock_irqsave(&priv->lock);
  bk7258_dvp_drop_events_locked(priv);
  if (!current_worker)
    {
      /* work_cancel_sync() owns the queued work after it returns.  Mirror
       * that state in the wrapper so a later capture can schedule LPWORK
       * again.  A callback stopping itself must leave these fields for the
       * worker's normal empty-queue exit path. */

      priv->work_queued = false;
      priv->worker_running = false;
      priv->worker_tid = (pid_t)-1;
    }
  priv->stopping = false;
  spin_unlock_irqrestore(&priv->lock, flags);
  nxmutex_unlock(&priv->api_lock);
  return ret;
}

static FAR struct frame_buffer_t *bk7258_dvp_frame_malloc(
  image_format_t format, uint32_t size)
{
  FAR struct bk7258_dvp_s *priv = &g_bk7258_dvp;
  irqstate_t flags;
  uint8_t i;

  flags = spin_lock_irqsave(&priv->lock);
  for (i = 0; i < priv->config.frame_count; i++)
    {
      FAR const struct bk7258_dvp_frame_mem_s *memory =
        &priv->config.frames[i];

      if (!priv->frame_busy[i] && memory->addr != NULL &&
          memory->size >= size)
        {
          FAR struct frame_buffer_t *frame = &priv->frames[i];

          memset(frame, 0, sizeof(*frame));
          frame->frame = memory->addr;
          frame->size = memory->size;
          frame->type = DVP_CAMERA;
          frame->width = priv->sdk_config.width;
          frame->height = priv->sdk_config.height;
          frame->fmt = format == IMAGE_MJPEG ? PIXEL_FMT_JPEG :
                       format == IMAGE_H264 ? PIXEL_FMT_H264 :
                       PIXEL_FMT_UNKNOW;
          priv->frame_busy[i] = true;
          spin_unlock_irqrestore(&priv->lock, flags);
          return frame;
        }
    }

  spin_unlock_irqrestore(&priv->lock, flags);
  return NULL;
}

static void bk7258_dvp_frame_complete(image_format_t format,
                                      FAR struct frame_buffer_t *frame,
                                      int result)
{
  FAR struct bk7258_dvp_s *priv = &g_bk7258_dvp;
  irqstate_t flags;
  bool queue_work = false;
  int index;

  (void)format;

  flags = spin_lock_irqsave(&priv->lock);
  index = bk7258_dvp_frame_index(priv, frame);
  if (index < 0 || !priv->frame_busy[index] || !priv->capture_active ||
      priv->stopping)
    {
      if (index >= 0)
        {
          priv->frame_busy[index] = false;
        }
      spin_unlock_irqrestore(&priv->lock, flags);
      return;
    }

  if (priv->event_count >= BK7258_DVP_EVENT_DEPTH)
    {
      /* An ISR cannot wait for NuttX video consumption.  Drop this completed
       * frame and return its descriptor to the bounded pool. */
      priv->frame_busy[index] = false;
      spin_unlock_irqrestore(&priv->lock, flags);
      return;
    }

  priv->events[(priv->event_head + priv->event_count) %
               BK7258_DVP_EVENT_DEPTH].frame = frame;
  priv->events[(priv->event_head + priv->event_count) %
               BK7258_DVP_EVENT_DEPTH].result = (uint8_t)result;
  priv->event_count++;
  if (!priv->work_queued)
    {
      priv->work_queued = true;
      queue_work = true;
    }
  spin_unlock_irqrestore(&priv->lock, flags);

  if (queue_work && work_queue(LPWORK, &priv->complete_work,
                               bk7258_dvp_complete_worker, priv, 0) < 0)
    {
      bk7258_dvp_schedule_failed(priv);
    }
}

static bool bk7258_dvp_format_supported(FAR struct bk7258_dvp_s *priv,
                                         uint32_t format)
{
  if (priv->sdk_config.img_format == IMAGE_YUV)
    {
      return format == IMGDATA_PIX_FMT_YUYV ||
             format == IMGDATA_PIX_FMT_UYVY;
    }

  if (priv->sdk_config.img_format == IMAGE_MJPEG)
    {
      return format == IMGDATA_PIX_FMT_JPEG;
    }

  if (priv->sdk_config.img_format == IMAGE_H264)
    {
      /* This NuttX revision publishes V4L2_PIX_FMT_H264 but its private
       * V4L2-to-imgdata converter has no matching IMGDATA_PIX_FMT_H264.
       * Unknown compressed formats reach a lower-half as the legacy
       * JPEG_WITH_SUBIMG token.  Accept that token only when this instance
       * was explicitly configured as IMAGE_H264; the public ABI remains
       * standard V4L2 H.264 and no JPEG data is advertised or returned. */

