open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dvp.c
      return format == IMGDATA_PIX_FMT_JPEG_WITH_SUBIMG;
    }

  return false;
}

static uint32_t bk7258_dvp_fps_hz(frame_fps_t fps)
{
  switch (fps)
    {
      case FPS5:
        return 5;
      case FPS10:
        return 10;
      case FPS15:
        return 15;
      case FPS20:
        return 20;
      case FPS25:
        return 25;
      case FPS30:
        return 30;
      default:
        return 0;
    }
}

static int bk7258_dvp_make_sdk_config(
  FAR const struct bk7258_dvp_sensor_config_s *sensor,
  FAR bk_dvp_config_t *sdk)
{
  frame_fps_t fps;
  uint16_t format;

  if (sensor == NULL || sdk == NULL || sensor->width == 0 ||
      sensor->height == 0 || sensor->i2c_frequency == 0 ||
      sensor->mclk_hz != BK7258_DVP_MCLK_24MHZ)
    {
      return -EINVAL;
    }

  switch (sensor->data_width)
    {
      case BK7258_DVP_DATA_WIDTH_8:
      case BK7258_DVP_DATA_WIDTH_10:
      case BK7258_DVP_DATA_WIDTH_12:
      case BK7258_DVP_DATA_WIDTH_16:
        break;

      default:
        return -EINVAL;
    }

  switch (sensor->fps)
    {
      case 5:
        fps = FPS5;
        break;
      case 10:
        fps = FPS10;
        break;
      case 15:
        fps = FPS15;
        break;
      case 20:
        fps = FPS20;
        break;
      case 25:
        fps = FPS25;
        break;
      case 30:
        fps = FPS30;
        break;
      default:
        return -ENOTSUP;
    }

  switch (sensor->format)
    {
      case BK7258_DVP_FORMAT_YUV:
        format = IMAGE_YUV;
        break;
      case BK7258_DVP_FORMAT_MJPEG:
        format = IMAGE_MJPEG;
        break;
      case BK7258_DVP_FORMAT_H264:
        format = IMAGE_H264;
        break;
      default:
        return -ENOTSUP;
    }

  memset(sdk, 0, sizeof(*sdk));
  sdk->i2c_config.id = sensor->i2c_bus;
  sdk->i2c_config.scl_pin = sensor->i2c_scl_pin;
  sdk->i2c_config.sda_pin = sensor->i2c_sda_pin;
  sdk->i2c_config.baud_rate = sensor->i2c_frequency;
  sdk->reset_pin = sensor->reset_pin;
  sdk->pwdn_pin = sensor->pwdn_pin;
  sdk->io_config.data_width = (sensor_bits_width_t)sensor->data_width;
  memcpy(sdk->io_config.data_pin, sensor->data_pin,
         sizeof(sdk->io_config.data_pin));
  sdk->io_config.vsync_pin = sensor->vsync_pin;
  sdk->io_config.hsync_pin = sensor->hsync_pin;
  sdk->io_config.xclk_pin = sensor->mclk_pin;
  sdk->io_config.pclk_pin = sensor->pclk_pin;
  sdk->clk_source = MCLK_24M;
  sdk->width = sensor->width;
  sdk->height = sensor->height;
  sdk->fps = fps;
  sdk->img_format = format;
  return OK;
}

int bk7258_dvp_get_buffer_requirements(
  FAR const struct bk7258_dvp_sensor_config_s *sensor,
  FAR struct bk7258_dvp_buffer_requirements_s *requirements)
{
  bk_dvp_config_t sdk;
  uint64_t frame_size;
  uint64_t encode_size;
  int ret;

  if (requirements == NULL)
    {
      return -EINVAL;
    }

  ret = bk7258_dvp_make_sdk_config(sensor, &sdk);
  if (ret < 0)
    {
      return ret;
    }

  if (sdk.img_format == IMAGE_YUV)
    {
      frame_size = (uint64_t)sdk.width * sdk.height * 2u;
      encode_size = 0u;
    }
  else if (sdk.img_format == IMAGE_H264)
    {
      frame_size = CONFIG_H264_FRAME_SIZE;
      encode_size = (uint64_t)sdk.width * 32u * 2u;
    }
  else
    {
      frame_size = CONFIG_JPEG_FRAME_SIZE;
      encode_size = (uint64_t)sdk.width * 16u * 2u;
    }

  if (frame_size == 0u || frame_size > UINT32_MAX ||
      encode_size > UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  requirements->frame_size = (uint32_t)frame_size;
  requirements->encode_buffer_size = (uint32_t)encode_size;
  return OK;
}

static int bk7258_dvp_validate_frame_setting(
  FAR struct bk7258_dvp_s *priv, uint8_t nr_datafmts,
  FAR imgdata_format_t *datafmts, FAR imgdata_interval_t *interval)
{
  if (nr_datafmts == 0 || nr_datafmts > 1 || datafmts == NULL)
    {
      return -EINVAL;
    }

  if (datafmts[IMGDATA_FMT_MAIN].width != priv->sdk_config.width ||
      datafmts[IMGDATA_FMT_MAIN].height != priv->sdk_config.height ||
      !bk7258_dvp_format_supported(priv,
                                   datafmts[IMGDATA_FMT_MAIN].pixelformat))
    {
      return -ENOTSUP;
    }

  if (interval != NULL &&
      (interval->numerator == 0 || interval->denominator == 0))
    {
      return -EINVAL;
    }

  if (interval != NULL &&
      (uint64_t)bk7258_dvp_fps_hz((frame_fps_t)priv->sdk_config.fps) *
      interval->numerator !=
      interval->denominator)
    {
      return -ENOTSUP;
    }

  return 0;
}

static int bk7258_dvp_data_init(FAR struct imgdata_s *data)
{
  FAR struct bk7258_dvp_s *priv = bk7258_dvp_from_data(data);
  irqstate_t flags;
  bk_err_t error;
  int ret;

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->stopping)
    {
      nxmutex_unlock(&priv->api_lock);
      return -EBUSY;
    }

  if (priv->handle != NULL)
    {
      nxmutex_unlock(&priv->api_lock);
      return 0;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (priv->work_queued || priv->worker_running)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      nxmutex_unlock(&priv->api_lock);
      return -EBUSY;
    }

  memset(priv->frame_busy, 0, sizeof(priv->frame_busy));
  priv->event_head = 0;
  priv->event_count = 0;
  priv->work_queued = false;
  priv->capture_active = false;
  priv->capture_cb = NULL;
  priv->capture_arg = NULL;
  priv->next_buffer = NULL;
  priv->next_size = 0;
  priv->stopping = false;
  priv->worker_running = false;
  priv->worker_tid = (pid_t)-1;
  spin_unlock_irqrestore(&priv->lock, flags);

  /* The SDK detector configures MCLK before its JPEG driver acquires that
   * clock.  Acquire it explicitly through the project-owned CP clock service
   * so the vendor detector observes the same prerequisite without bypassing
   * the NuttX/CP ownership boundary. */

  /* The SDK treats DMA, YUV buffer and JPEG encoder as AP-wide shared
   * drivers.  NuttX does not call the vendor-wide initializer, so perform
   * the same idempotent operations at this wrapper boundary.  Deliberately
   * do not deinitialize them on camera close: LCD, I2S and other AP clients
   * share their global state, channel pool or IRQs. */

  if (priv->sdk_config.img_format == IMAGE_H264)
    {
      ret = bk7258_media_root_initialize(BK7258_MEDIA_ROOT_H264);
    }
  else
    {
      ret = bk7258_media_root_initialize(BK7258_MEDIA_ROOT_JPEG);
    }
  if (ret < 0)
    {
      nxmutex_unlock(&priv->api_lock);
      return ret;
    }

  ret = bk7258_dvp_pm_acquire(priv);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->api_lock);
      return ret;
    }

  if (priv->config.binding != NULL &&
      priv->config.binding->prepare != NULL)
    {
      ret = priv->config.binding->prepare(priv->config.binding->arg);
      if (ret != 0)
        {
          (void)bk7258_dvp_pm_release(priv);
          nxmutex_unlock(&priv->api_lock);
          return ret < 0 ? ret : -EIO;
        }
    }

  /* The SDK DVP detector owns controller-specific I2C1 setup/teardown, but
   * it assumes the AP-wide I2C driver root is already live.  Hold that root
   * independently of /dev/i2c0 so an accelerometer close cannot tear it down
   * while SCCB probing or camera streaming is active.
   */

  ret = bk7258_dvp_i2c_driver_acquire(priv);
  if (ret < 0)
    {
      (void)bk7258_dvp_pm_release(priv);
      nxmutex_unlock(&priv->api_lock);
      return ret;
    }

#ifdef CONFIG_BK7258_DVP_H264_COMPAT
  if (priv->sdk_config.img_format == IMAGE_H264)
    {
      g_bk7258_dvp_h264_opening = true;
      g_bk7258_dvp_h264_yuv_deferred = false;
      g_bk7258_dvp_h264_encode_deferred = false;
      g_bk7258_dvp_yuv_irq_deferred = false;
      g_bk7258_dvp_h264_irq_deferred = false;
      g_bk7258_dvp.deferred_i2c_count = 0;
    }
#endif

  error = bk_dvp_open(&priv->handle, &priv->sdk_config,
                      &g_bk7258_dvp_callback, priv->config.encode_buffer);
  ret = bk7258_dvp_error(error);
#ifdef CONFIG_BK7258_DVP_H264_COMPAT
  if (priv->sdk_config.img_format == IMAGE_H264)
    {
      g_bk7258_dvp_h264_opening = false;
    }
#endif
  if (ret < 0 || priv->handle == NULL)
    {
      if (ret >= 0)
        {
          ret = -EIO;
        }

      priv->handle = NULL;
      priv->deferred_i2c_count = 0;
      (void)bk7258_dvp_i2c_driver_release(priv);
      (void)bk7258_dvp_pm_release(priv);

      nxmutex_unlock(&priv->api_lock);
      return ret;
    }

  /* From this point the non-NULL SDK handle is the single ownership token.
   * Set no parallel "open" flag which could diverge during a partial setup
   * failure.  Every later failure is routed through the same
   * bk_dvp_close()/PM cleanup path as normal imgdata uninitialize. */

