open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dvp.c
  priv->suspended = false;

  /* The SDK may start the H.264 data path before completing a sensor
   * descriptor.  A descriptor may begin driving DVP near the OUTPUT entries
   * of its init table, which can raise YUV/H.264 IRQs while bk_dvp_open()
   * still owns partially initialized state.  Defer only the first H.264
   * start until the immutable SDK has completed sensor init; later frame
   * restarts still pass straight through the wrappers above. */

#ifdef CONFIG_BK7258_DVP_H264_COMPAT
  if (priv->sdk_config.img_format == IMAGE_H264)
    {
      if (g_bk7258_dvp_yuv_irq_deferred)
        {
          error = __real_sys_drv_int_group2_enable(
            BK7258_YUVB_GROUP2_MASK);
          if (error != 0)
            {
              ret = -EIO;
              goto fail_open;
            }
        }

      if (g_bk7258_dvp_h264_irq_deferred)
        {
          error = __real_sys_drv_core_intr_group2_enable(
            g_bk7258_dvp_h264_irq_core, BK7258_H264_GROUP2_MASK);
          if (error != 0)
            {
              ret = -EIO;
              goto fail_open;
            }
        }

      if (g_bk7258_dvp_h264_yuv_deferred)
        {
          ret = bk7258_dvp_error(__real_bk_yuv_buf_start(H264_MODE));
          if (ret < 0)
            {
              goto fail_open;
            }
        }

      if (g_bk7258_dvp_h264_encode_deferred)
        {
          ret = bk7258_dvp_error(__real_bk_h264_encode_enable());
          if (ret < 0)
            {
              goto fail_open;
            }
        }

      for (uint8_t i = 0; i < g_bk7258_dvp.deferred_i2c_count; i++)
        {
          ret = bk7258_dvp_error(__real_dvp_camera_i2c_write_uint8(
            g_bk7258_dvp.deferred_i2c[i].addr,
            g_bk7258_dvp.deferred_i2c[i].reg,
            g_bk7258_dvp.deferred_i2c[i].value));
          if (ret < 0)
            {
              goto fail_open;
            }
        }

      g_bk7258_dvp.deferred_i2c_count = 0;

    }
#endif

  /* bk_dvp_open() starts the vendor stream before returning.  Until V4L2
   * queues its first buffer, the bounded callback pool drops frames. */

  nxmutex_unlock(&priv->api_lock);
  return 0;

#ifdef CONFIG_BK7258_DVP_H264_COMPAT
fail_open:
  nxmutex_unlock(&priv->api_lock);
  (void)bk7258_dvp_data_uninit(data);
  return ret;
#endif
}

static int bk7258_dvp_data_uninit(FAR struct imgdata_s *data)
{
  FAR struct bk7258_dvp_s *priv = bk7258_dvp_from_data(data);
  irqstate_t flags;
  bool current_worker;
  int stop_ret;
  int close_ret;
  int i2c_ret = 0;
  int pm_ret = 0;
  int cancel_ret = 0;
  int ret;

  stop_ret = bk7258_dvp_stop_stream(priv);

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (priv->handle == NULL)
    {
      spin_unlock_irqrestore(&priv->lock, flags);

      /* A previous close may already have consumed the SDK handle while a
       * PM put failed.  The PM ownership bits deliberately remain set in
       * that case, so a repeated imgdata uninit must retry their release
       * instead of treating the NULL handle as a fully closed object. */

      if (priv->i2c_driver_held)
        {
          i2c_ret = bk7258_dvp_i2c_driver_release(priv);
        }

      if (priv->pm_mclk_held || priv->pm_clock_held ||
      priv->pm_frequency_held)
        {
          pm_ret = bk7258_dvp_pm_release(priv);
        }

      nxmutex_unlock(&priv->api_lock);
      if (stop_ret < 0)
        {
          return stop_ret;
        }

      return i2c_ret < 0 ? i2c_ret : pm_ret;
    }

  if (priv->stopping)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      nxmutex_unlock(&priv->api_lock);
      return stop_ret < 0 ? stop_ret : -EBUSY;
    }

  priv->stopping = true;
  priv->capture_active = false;
  priv->capture_cb = NULL;
  priv->capture_arg = NULL;
  camera_handle_t handle = priv->handle;
  spin_unlock_irqrestore(&priv->lock, flags);

  nxmutex_unlock(&priv->api_lock);

  /* bk_dvp_close() may wait for the SDK's own frame path.  Do not hold the
   * wrapper mutex while it runs, and never synchronously cancel this worker
   * from itself.  v3.1.1.9 always consumes a non-NULL handle and returns
   * BK_OK; clearing the token below therefore completes that ownership pair. */
  close_ret = bk7258_dvp_error(bk_dvp_close(handle));
  current_worker = bk7258_dvp_is_current_worker(priv);
  if (!current_worker)
    {
      cancel_ret = work_cancel_sync(LPWORK, &priv->complete_work);
      if (cancel_ret == -ENOENT)
        {
          cancel_ret = 0;
        }
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return close_ret < 0 ? close_ret : ret;
    }
  flags = spin_lock_irqsave(&priv->lock);
  bk7258_dvp_drop_events_locked(priv);
  if (!current_worker)
    {
      priv->work_queued = false;
      priv->worker_running = false;
      priv->worker_tid = (pid_t)-1;
    }
  if (close_ret == 0)
    {
      priv->handle = NULL;
      priv->suspended = false;
    }
  priv->stopping = false;
  spin_unlock_irqrestore(&priv->lock, flags);

  if (close_ret == 0)
    {
      i2c_ret = bk7258_dvp_i2c_driver_release(priv);
      pm_ret = bk7258_dvp_pm_release(priv);
    }

  nxmutex_unlock(&priv->api_lock);

  if (close_ret < 0)
    {
      return close_ret;
    }
  if (stop_ret < 0)
    {
      return stop_ret;
    }
  if (cancel_ret < 0)
    {
      return cancel_ret;
    }

  if (i2c_ret < 0)
    {
      return i2c_ret;
    }

  return pm_ret < 0 ? pm_ret : 0;
}

static int bk7258_dvp_data_set_buf(FAR struct imgdata_s *data,
                                   uint8_t nr_datafmts,
                                   FAR imgdata_format_t *datafmts,
                                   FAR uint8_t *addr, uint32_t size)
{
  FAR struct bk7258_dvp_s *priv = bk7258_dvp_from_data(data);
  irqstate_t flags;
  int ret;

  ret = bk7258_dvp_validate_frame_setting(priv, nr_datafmts, datafmts,
                                          NULL);
  if (ret < 0 || addr == NULL || size == 0)
    {
      return ret < 0 ? ret : -EINVAL;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (priv->handle == NULL)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -ENODEV;
    }
  if (priv->stopping)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -EBUSY;
    }
  if (priv->next_buffer != NULL)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -EBUSY;
    }
  priv->next_buffer = addr;
  priv->next_size = size;
  spin_unlock_irqrestore(&priv->lock, flags);
  return 0;
}

static int bk7258_dvp_data_validate_frame_setting(
  FAR struct imgdata_s *data, uint8_t nr_datafmts,
  FAR imgdata_format_t *datafmts, FAR imgdata_interval_t *interval)
{
  FAR struct bk7258_dvp_s *priv = bk7258_dvp_from_data(data);

  return bk7258_dvp_validate_frame_setting(priv, nr_datafmts, datafmts,
                                           interval);
}

static int bk7258_dvp_data_start_capture(
  FAR struct imgdata_s *data, uint8_t nr_datafmts,
  FAR imgdata_format_t *datafmts, FAR imgdata_interval_t *interval,
  imgdata_capture_t callback, FAR void *arg)
{
  FAR struct bk7258_dvp_s *priv = bk7258_dvp_from_data(data);
  irqstate_t flags;
  bool resume;
  int ret;

  ret = bk7258_dvp_validate_frame_setting(priv, nr_datafmts, datafmts,
                                          interval);
  if (ret < 0 || callback == NULL)
    {
      return ret < 0 ? ret : -EINVAL;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (priv->handle == NULL)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      nxmutex_unlock(&priv->api_lock);
      return -ENODEV;
    }
  if (priv->stopping)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      nxmutex_unlock(&priv->api_lock);
      return -EBUSY;
    }
  if (priv->capture_active)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      nxmutex_unlock(&priv->api_lock);
      return -EBUSY;
    }
  if (priv->next_buffer == NULL)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      nxmutex_unlock(&priv->api_lock);
      return -EINVAL;
    }
  resume = priv->suspended;
  priv->capture_cb = callback;
  priv->capture_arg = arg;
  priv->capture_active = true;
  spin_unlock_irqrestore(&priv->lock, flags);

  if (resume)
    {
      ret = bk7258_dvp_error(bk_dvp_resume(priv->handle));
      if (ret < 0)
        {
          flags = spin_lock_irqsave(&priv->lock);
          priv->capture_active = false;
          priv->capture_cb = NULL;
          priv->capture_arg = NULL;
          spin_unlock_irqrestore(&priv->lock, flags);
          nxmutex_unlock(&priv->api_lock);
          return ret;
        }
      priv->suspended = false;
    }

  nxmutex_unlock(&priv->api_lock);
  return 0;
}

static int bk7258_dvp_data_stop_capture(FAR struct imgdata_s *data)
{
  FAR struct bk7258_dvp_s *priv = bk7258_dvp_from_data(data);
  irqstate_t flags;
  int ret;

  if (bk7258_dvp_is_current_worker(priv))
    {
      /* complete_capture() calls us with its upper-half spinlock held and
       * local interrupts disabled when the last queued buffer is consumed.
       * This is a delivery pause, not a thread-context SDK shutdown: taking
       * api_lock, resetting JPEG/YUV or joining work here violates that
       * callback context.  Keep the SDK handle alive for a subsequent QBUF;
       * external stop/uninitialize performs the synchronous hardware stop.
       * The in-flight frame stays owned by complete_worker until its callback
       * returns.  Later SDK completions are dropped while capture is idle.
       */

      flags = spin_lock_irqsave(&priv->lock);
      priv->capture_active = false;
      priv->capture_cb = NULL;
      priv->capture_arg = NULL;
      priv->next_buffer = NULL;
      priv->next_size = 0;
      bk7258_dvp_drop_events_locked(priv);
      spin_unlock_irqrestore(&priv->lock, flags);
      ret = 0;
    }
  else
    {
      ret = bk7258_dvp_stop_stream(priv);
    }
  return ret;
}

#ifdef CONFIG_BK7258_PSRAM
static FAR void *bk7258_dvp_data_alloc(FAR struct imgdata_s *data,
                                       uint32_t align_size, uint32_t size)
{
  FAR struct bk7258_dvp_allocation_s *allocation;
  FAR uint8_t *base;
  uintptr_t address;
  uintptr_t remainder;
  size_t overhead;

  (void)data;

  if (size == 0 || !bk7258_psram_ready())
    {
      return NULL;
    }

  if (align_size < sizeof(uintptr_t))
    {
      align_size = sizeof(uintptr_t);
    }

  overhead = sizeof(*allocation) + align_size - 1u;
  if (size > SIZE_MAX - overhead)
    {
      return NULL;
    }

