open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dvp.c
#ifdef CONFIG_BK7258_PSRAM_MEDIA
  /* V4L2 requests the complete MMAP pool in one allocation. The AP private
   * 640 KiB heap reserves 512 KiB for the system heap on AIDK, so even two
   * 100 KiB frames cannot fit there. Use the SDK encode slab, through the
   * chip allocator, for compressed capture buffers just like SDK frames.
   */

  base = bk7258_psram_media_malloc(BK7258_PSRAM_MEDIA_ENCODE,
                                   size + overhead);
#else
  base = bk7258_psram_malloc(size + overhead);
#endif
  if (base == NULL)
    {
      return NULL;
    }

  address = (uintptr_t)(base + sizeof(*allocation));
  remainder = address % align_size;
  if (remainder != 0)
    {
      address += align_size - remainder;
    }

  allocation = (FAR struct bk7258_dvp_allocation_s *)address - 1;
  allocation->base = base;
  allocation->magic = BK7258_DVP_ALLOC_MAGIC;
  return (FAR void *)address;
}

static void bk7258_dvp_data_free(FAR struct imgdata_s *data, FAR void *addr)
{
  FAR struct bk7258_dvp_allocation_s *allocation;
  FAR void *base;

  (void)data;

  if (addr == NULL)
    {
      return;
    }

  allocation = (FAR struct bk7258_dvp_allocation_s *)addr - 1;
  if (allocation->magic != BK7258_DVP_ALLOC_MAGIC)
    {
      return;
    }

  base = allocation->base;
  allocation->magic = 0;
  allocation->base = NULL;
#ifdef CONFIG_BK7258_PSRAM_MEDIA
  bk7258_psram_media_free(base);
#else
  bk7258_psram_free(base);
#endif
}
#endif

static const struct imgdata_ops_s g_bk7258_dvp_data_ops =
{
  .init = bk7258_dvp_data_init,
  .uninit = bk7258_dvp_data_uninit,
  .set_buf = bk7258_dvp_data_set_buf,
  .validate_frame_setting = bk7258_dvp_data_validate_frame_setting,
  .start_capture = bk7258_dvp_data_start_capture,
  .stop_capture = bk7258_dvp_data_stop_capture,
#ifdef CONFIG_BK7258_PSRAM
  .alloc = bk7258_dvp_data_alloc,
  .free = bk7258_dvp_data_free,
#endif
};

int bk7258_dvp_initialize(FAR const struct bk7258_dvp_config_s *config,
                          FAR struct bk7258_dvp_s **out)
{
  struct bk7258_dvp_buffer_requirements_s requirements;
  bk_dvp_config_t sdk;
  irqstate_t flags;
  uint8_t i;
  int ret;

  if (config == NULL || out == NULL || config->frames == NULL ||
      config->frame_count < 2 || config->frame_count > BK7258_DVP_MAX_FRAMES)
    {
      return -EINVAL;
    }

  if (config->binding != NULL &&
      (config->binding->version != BK7258_DVP_BINDING_VERSION ||
       config->binding->size < sizeof(*config->binding)))
    {
      return -EINVAL;
    }

  ret = bk7258_dvp_make_sdk_config(&config->sensor, &sdk);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dvp_get_buffer_requirements(&config->sensor,
                                            &requirements);
  if (ret < 0)
    {
      return ret;
    }

  if (requirements.encode_buffer_size != 0u &&
      (config->encode_buffer == NULL || config->encode_buffer_size == 0))
    {
      return -EINVAL;
    }

  if (config->encode_buffer_size < requirements.encode_buffer_size)
    {
      return -EINVAL;
    }

  for (i = 0; i < config->frame_count; i++)
    {
      if (config->frames[i].addr == NULL ||
          config->frames[i].size < requirements.frame_size)
        {
          return -EINVAL;
        }
    }

  ret = nxmutex_lock(&g_bk7258_dvp.api_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_bk7258_dvp.configured)
    {
      bool same = g_bk7258_dvp.config.frames == config->frames &&
                  g_bk7258_dvp.config.binding == config->binding &&
                  g_bk7258_dvp.config.frame_count == config->frame_count &&
                  g_bk7258_dvp.config.encode_buffer == config->encode_buffer &&
                  g_bk7258_dvp.config.encode_buffer_size ==
                  config->encode_buffer_size &&
                  memcmp(&g_bk7258_dvp.sdk_config, &sdk,
                         sizeof(sdk)) == 0;

      nxmutex_unlock(&g_bk7258_dvp.api_lock);
      if (same)
        {
          *out = &g_bk7258_dvp;
          return 0;
        }
      return -EBUSY;
    }

  spin_lock_init(&g_bk7258_dvp.lock);
  g_bk7258_dvp.config = *config;
  g_bk7258_dvp.sdk_config = sdk;
  g_bk7258_dvp.deferred_i2c_count = 0;
  g_bk7258_dvp.data.ops = &g_bk7258_dvp_data_ops;
  g_bk7258_dvp.configured = true;
  g_bk7258_dvp.handle = NULL;
  g_bk7258_dvp.pm_clock_held = false;
  g_bk7258_dvp.pm_mclk_held = false;
  g_bk7258_dvp.pm_frequency_held = false;
  g_bk7258_dvp.suspended = false;
  flags = spin_lock_irqsave(&g_bk7258_dvp.lock);
  memset(g_bk7258_dvp.frame_busy, 0, sizeof(g_bk7258_dvp.frame_busy));
  g_bk7258_dvp.event_head = 0;
  g_bk7258_dvp.event_count = 0;
  g_bk7258_dvp.work_queued = false;
  g_bk7258_dvp.worker_running = false;
  g_bk7258_dvp.worker_tid = (pid_t)-1;
  g_bk7258_dvp.stopping = false;
  g_bk7258_dvp.capture_active = false;
  spin_unlock_irqrestore(&g_bk7258_dvp.lock, flags);
  *out = &g_bk7258_dvp;
  nxmutex_unlock(&g_bk7258_dvp.api_lock);
  return 0;
}

FAR struct imgdata_s *bk7258_dvp_get_imgdata(FAR struct bk7258_dvp_s *priv)
{
  return priv == &g_bk7258_dvp && priv->configured ? &priv->data : NULL;
}

int bk7258_dvp_uninitialize(FAR struct bk7258_dvp_s *priv)
{
  int ret;

  if (priv != &g_bk7258_dvp)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }
  if (priv->handle != NULL)
    {
      nxmutex_unlock(&priv->api_lock);
      return -EBUSY;
    }

  if (priv->pm_mclk_held || priv->pm_clock_held ||
      priv->pm_frequency_held)
    {
      ret = bk7258_dvp_pm_release(priv);
      if (ret < 0)
        {
          nxmutex_unlock(&priv->api_lock);
          return ret;
        }
    }

  priv->configured = false;
  memset(&priv->config, 0, sizeof(priv->config));
  memset(&priv->sdk_config, 0, sizeof(priv->sdk_config));
  priv->data.ops = NULL;
  nxmutex_unlock(&priv->api_lock);
  return 0;
}

int bk7258_dvp_sensor_lock(FAR struct bk7258_dvp_s *priv)
{
  int ret;
  if (priv == NULL)
    {
      return -ENODEV;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->handle == NULL || priv->stopping)
    {
      nxmutex_unlock(&priv->api_lock);
      return -ENODEV;
    }

