open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dvp.c
  return 0;
}

void bk7258_dvp_sensor_unlock(FAR struct bk7258_dvp_s *priv)
{
  nxmutex_unlock(&priv->api_lock);
}

int bk7258_dvp_sensor_read(FAR struct bk7258_dvp_s *priv, uint8_t reg,
                           FAR uint8_t *value)
{
  dvp_sensor_reg_val_t transfer = {0};
  int ret;
  if (priv == NULL || value == NULL || priv->handle == NULL)
    {
      return -EINVAL;
    }

  transfer.reg = reg;
  ret = bk7258_dvp_error(bk_dvp_sensor_read_register(priv->handle, &transfer));
  if (ret >= 0)
    {
      *value = transfer.val;
    }

  return ret;
}

int bk7258_dvp_sensor_write(FAR struct bk7258_dvp_s *priv, uint8_t reg,
                            uint8_t value)
{
  dvp_sensor_reg_val_t transfer = {0};
  if (priv == NULL || priv->handle == NULL)
    {
      return -EINVAL;
    }

  transfer.reg = reg;
  transfer.val = value;
  return bk7258_dvp_error(bk_dvp_sensor_write_register(priv->handle, &transfer));
}

int bk7258_dvp_suspend(FAR struct bk7258_dvp_s *priv)
{
  int ret;

  if (priv != &g_bk7258_dvp)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }
  if (priv->handle == NULL)
    {
      nxmutex_unlock(&priv->api_lock);
      return -ENODEV;
    }
  if (priv->suspended)
    {
      nxmutex_unlock(&priv->api_lock);
      return 0;
    }

  ret = bk7258_dvp_error(bk_dvp_suspend(priv->handle));
  if (ret == 0)
    {
      priv->suspended = true;
    }
  nxmutex_unlock(&priv->api_lock);
  return ret;
}

int bk7258_dvp_resume(FAR struct bk7258_dvp_s *priv)
{
  int ret;

  if (priv != &g_bk7258_dvp)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }
  if (priv->handle == NULL)
    {
      nxmutex_unlock(&priv->api_lock);
      return -ENODEV;
    }
  if (!priv->suspended)
    {
      nxmutex_unlock(&priv->api_lock);
      return 0;
    }

  ret = bk7258_dvp_error(bk_dvp_resume(priv->handle));
  if (ret == 0)
    {
      priv->suspended = false;
    }
  nxmutex_unlock(&priv->api_lock);
  return ret;
}
